# 23. Split DataFrame into test and train split

video: https://www.youtube.com/watch?v=oH3wYKvwpJ8&index=23&list=PL5-da3qGB5ICCsgW1MxlZ0Hq8LL5U3u9y&spfreload=1

### DataFrame.isnull() vs pd.isnull(DataFrame)

In [3]:
import pandas as pd

In [4]:
ufo = pd.read_csv('http://bit.ly/uforeports')

In [5]:
pd.isnull(ufo).head()

    City  Colors Reported  Shape Reported  State   Time
0  False             True           False  False  False
1  False             True           False  False  False
2  False             True           False  False  False
3  False             True           False  False  False
4  False             True           False  False  False

In [6]:
ufo.isnull().head()

    City  Colors Reported  Shape Reported  State   Time
0  False             True           False  False  False
1  False             True           False  False  False
2  False             True           False  False  False
3  False             True           False  False  False
4  False             True           False  False  False

### Inclusive vs Exclusive range selection in loc vs iloc

In [8]:
ufo.loc[0:4, :]

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [9]:
ufo.iloc[0:4, :]

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3      Abilene             NaN           DISK    KS   6/1/1931 13:00

In [10]:
# python list is exclusive
list(range(0,4))

[0, 1, 2, 3]

In [13]:
# iloc has to be inclusive because it would not make sence to be exclusive if I want City to State and it would cut out State
ufo.loc[: ,'City':'State'].head()

                   City Colors Reported Shape Reported State
0                Ithaca             NaN       TRIANGLE    NY
1           Willingboro             NaN          OTHER    NJ
2               Holyoke             NaN           OVAL    CO
3               Abilene             NaN           DISK    KS
4  New York Worlds Fair             NaN          LIGHT    NY

### Sample random DataFrame rows

In [17]:
ufo.sample(n=3, random_state= 42)

               City Colors Reported Shape Reported State              Time
217    Norridgewock             NaN           DISK    ME   9/15/1952 14:00
12282         Ipava             NaN       TRIANGLE    IL   10/1/1998 21:15
17933     Ellinwood             NaN       FIREBALL    KS  11/13/2000 22:00

In [19]:
ufo.sample(frac = 0.75, random_state = 99).head()

                 City Colors Reported Shape Reported State              Time
6250        Sunnyvale             NaN          OTHER    CA   12/16/1989 0:00
8656   Corpus Christi             NaN            NaN    TX    9/13/1995 0:10
2729           Mentor             NaN           DISK    OH    8/8/1974 10:00
7348           Wilson             NaN          LIGHT    WI     6/1/1994 1:00
12637          Lowell             NaN         CIRCLE    MA  11/26/1998 10:00

### Bonus : Split DataFrame into test and train split

In [26]:
train = ufo.sample(frac = 0.75, random_state = 99)

In [27]:
train.head()

                 City Colors Reported Shape Reported State              Time
6250        Sunnyvale             NaN          OTHER    CA   12/16/1989 0:00
8656   Corpus Christi             NaN            NaN    TX    9/13/1995 0:10
2729           Mentor             NaN           DISK    OH    8/8/1974 10:00
7348           Wilson             NaN          LIGHT    WI     6/1/1994 1:00
12637          Lowell             NaN         CIRCLE    MA  11/26/1998 10:00

In [28]:
test = ufo.loc[~ufo.index.isin(train.index), :]

In [29]:
train.shape

(13681, 5)

In [30]:
test.shape

(4560, 5)

In [31]:
ufo.shape

(18241, 5)

In [32]:
ufo.index.isin(train.index)

array([ True,  True,  True, ..., False,  True,  True], dtype=bool)